# -*- coding: utf-8 -*-
=begin

NameInput EX by 허걱

#------------------------------------------------------------------------------

REQUIRES :
Input Ex - 전체키 입력 확장 by 허걱
The Korean - 조합한글 by 허걱

#------------------------------------------------------------------------------

이름 입력의 처리 스크립트 입니다.
기존의 이름 입력의 처리를 대신합니다.

이벤트의 [이름 입력의 처리] 커맨드를 그대로 사용.

=end

#==============================================================================
# ■ NameInputConfig
#------------------------------------------------------------------------------
# 　이름입력의 기본값 설정항목 입니다.
#==============================================================================

module NameInputConfig
  TITLE = ""            # 기본 타이틀
  DRAW_FACE = false     # 기본 얼굴 그래픽 표시 플래그
end

#==============================================================================
# ■ Game_Temp
#==============================================================================
class Game_Temp
  #--------------------------------------------------------------------------
  # ● 
  #--------------------------------------------------------------------------
  attr_accessor :ni_title
  attr_accessor :ni_face
  #--------------------------------------------------------------------------
  # ● 
  #--------------------------------------------------------------------------
  alias nameinputEx_game_temp_initialize initialize
  def initialize
    nameinputEx_game_temp_initialize
    @ni_title = NameInputConfig::TITLE
    @ni_face = NameInputConfig::DRAW_FACE
  end
end

#==============================================================================
# ■ Window_Name
#------------------------------------------------------------------------------
# 　이름입력화면에서, 입력처리를 하는 윈도우 입니다.
#==============================================================================

class Window_Name < Window_Base
  #--------------------------------------------------------------------------
  # ● 
  #--------------------------------------------------------------------------
  def initialize(actor, max_char)
    @actor = actor
    @max_char = max_char
    width = 32 + (face_draw? ? 96 : 0)
    width += [(@max_char * (word_w + 1)), text_width(title_text) + word_w].max
    height = 32 + (face_draw? ? 96 : 20)
    height += (title_text == "" ? 0 : (face_draw? ? 0 : 20))
    x = Graphics.width/2 - width/2
    y = Graphics.height/2 - height/2
    super(x, y, width, height)
    @handler = {}
    @name = Korean.new
    @name.set_text(@actor.name)
    refresh
  end
  #--------------------------------------------------------------------------
  # ● 
  #--------------------------------------------------------------------------
  def dispose
    $game_temp.ni_title = NameInputConfig::TITLE
    $game_temp.ni_face = NameInputConfig::DRAW_FACE
    super
  end
  #--------------------------------------------------------------------------
  # ● 
  #--------------------------------------------------------------------------
  def text_width(text)
    bitmap = Bitmap.new(1,1)
    w = bitmap.text_size(text).width
    bitmap.dispose
    return w
  end
  #--------------------------------------------------------------------------
  # ● 
  #--------------------------------------------------------------------------
  def name
    @name.text
  end
  #--------------------------------------------------------------------------
  # ● 
  #--------------------------------------------------------------------------
  def set_handler(symbol, method)
    @handler[symbol] = method
  end
  #--------------------------------------------------------------------------
  # ● 
  #--------------------------------------------------------------------------
  def update
    super
    update_input
  end
  #--------------------------------------------------------------------------
  # ● 
  #--------------------------------------------------------------------------
  def update_input
    if Input.trigger?(Keys::Enter)
      @handler[:ok].call
    elsif Input.trigger?(Keys::Esc)
      @handler[:cancel].call
    elsif Input.repeat?(Keys::Back) && name.size == 0
      Sound.play_buzzer
    else
      update_name
    end
  end
  #--------------------------------------------------------------------------
  # ● 
  #--------------------------------------------------------------------------
  def update_name
    last_name = name.dup
    @name.add(Input.get_key) if Input.any_key?
    if last_name != name
      if name.size > @max_char
        @name.delete_other
        @name.add_text("", false)
        Sound.play_buzzer
      end
      refresh
    end
  end
  #--------------------------------------------------------------------------
  # ● 화면 묘화
  #--------------------------------------------------------------------------
  def refresh
    contents.clear
    refresh_face
    refresh_title
    refresh_text
  end
  #--------------------------------------------------------------------------
  # ● 
  #--------------------------------------------------------------------------
  def refresh_face
    return unless face_draw?
    draw_face(@actor.face_name, @actor.face_index, 0, 0)
  end
  #--------------------------------------------------------------------------
  # ● 
  #--------------------------------------------------------------------------
  def refresh_title
    return if title_text == ""
    text = title_text
    contents.font.color = system_color
    size = contents.text_size(text)
    x = face_draw? ? 48 : 0
    x += contents.width/2 - size.width/2
    draw_text(x, 0, width, line_h(text), text)
  end
  #--------------------------------------------------------------------------
  # ● 
  #--------------------------------------------------------------------------
  def refresh_text
    contents.font.color = normal_color
    text = name.dup.scan(/./)
    x = face_draw? ? 48 : 0
    x += (contents.width - (word_w*@max_char))/2
    y = face_draw? ? 38 : 0
    y += title_text == "" ? 0 : face_draw? ? 10 : 20
    h = line_h(name)
    @max_char.times {|i|
    if i < text.size
      draw_text(x, y, word_w, h, text[i])
    else
      draw_text(x, y, word_w, h, '_')
    end
    x += word_w
    }
  end
  #--------------------------------------------------------------------------
  # ● 
  #--------------------------------------------------------------------------
  def line_h(text)
    calc_line_height(text)
  end
  #--------------------------------------------------------------------------
  # ● 
  #--------------------------------------------------------------------------
  def title_text
    $game_temp.ni_title
  end
  #--------------------------------------------------------------------------
  # ● 
  #--------------------------------------------------------------------------
  def face_draw?
    $game_temp.ni_face
  end
  #--------------------------------------------------------------------------
  # ● 
  #--------------------------------------------------------------------------
  def word_w
    14
  end
end

#==============================================================================
# ■ Scene_Name
#------------------------------------------------------------------------------
# 　이름입력화면을 처리하는 클래스 입니다.
#==============================================================================

class Scene_Name < Scene_MenuBase
  #--------------------------------------------------------------------------
  # ● 준비
  #--------------------------------------------------------------------------
  def prepare(actor_id, max_char)
    @actor_id = actor_id
    @max_char = max_char
  end
  #--------------------------------------------------------------------------
  # ● 시작
  #--------------------------------------------------------------------------
  def start
    super
    @actor = $game_actors[@actor_id]
    @edit_window = Window_Name.new(@actor, @max_char)
    @edit_window.set_handler(:ok, method(:on_ok))
    @edit_window.set_handler(:cancel, method(:on_cancel))
  end
  #--------------------------------------------------------------------------
  # ● 입력 [결정]
  #--------------------------------------------------------------------------
  def on_ok
    if @actor.name != @edit_window.name
      @actor.name = @edit_window.name
      Sound.play_ok
    else
      Sound.play_cancel
    end
    return_scene
  end
  #--------------------------------------------------------------------------
  # ● 입력 [취소]
  #--------------------------------------------------------------------------
  def on_cancel
    Sound.play_cancel
    return_scene
  end
end






# presented by 허걱